{
  "title": "Why we're building PRDKit",
  "content": "We believe the next generation of software will be shaped not just by how it's built, but by how clearly it's defined.\n\n In the age of AI, natural language has become a powerful interface for creating software. But while it’s easier than ever to start building, *knowing what to build—and aligning your team around it—has never been more important*. That’s why we built PRDKit: to help product teams harness AI for clear, actionable, and complete product definitions.\n\n### **Our Story**\n\nOur journey in the product space spans over a decade. As the founders of Brand.ai, we built the industry's first design system manager, which was later acquired by InVision to become InVision DSM.\n\n### **Why Now?**\n\nAI is accelerating how software gets built—but without a clear source of truth, speed becomes a liability. It's easier than ever to lose sight of what's being built, why it matters, and who's aligned around it.\n\nAs product velocity increases, teams fall out of sync—product moves ahead while marketing, support, and sales lag behind. What's missing isn't just documentation—it's a shared system of intent.\n\nPRDKit gives teams that foundation. It keeps humans in the loop, makes AI's output traceable, and ensures everyone—from engineering to GTM—can move forward with clarity and confidence.\n\n### **Our Vision - PRDs as living interfaces**\n\nAs development becomes faster and more distributed, PRDs will evolve from dusty documents into living interfaces between humans and AI.\n\nThese won't be static specs buried in folders—they'll be dynamic, always up-to-date, and structured to guide both human teams and AI collaborators. They'll capture not just what to build, but why, and serve as the connective tissue across product, engineering, marketing, support, and sales.\n\nWe see a future where alignment is continuous, not a one-time event—where every stakeholder operates from the same source of truth, and every AI action is grounded in shared intent.\n\n### **Our Mission**\n\nWe're on a mission to bring clarity and alignment to product development in the AI era.\n\nWhether you're launching something new or iterating on a mature product, PRDKit helps you define the right thing to build, faster—and gives your team the confidence to build it well.\n\n# #\n\n Ehud & Amit"
}
